In [2]:
# Pandas by Simplilearn
import numpy as np
import pandas as pd

In [3]:
first_series = pd.Series(list('abcdef'))
first_series

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [6]:
np_country = np.array(['Luxemborg', 'Norway', 'Japan', 'Switzerland', 'United States', 
                       'Qatar', 'Iceland', 'Sweden', 'Singapore', 'Denmark'])

In [9]:
s_country = pd.Series(np_country)

In [10]:
s_country

0        Luxemborg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

In [11]:
a = pd.Series([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,
               588.3691778,2890.345675,24733.62696,1445.760002,4803.398244,2618.876037,
               590.4521124,665.7982328,7122.938458,2639.54156,3362.4656,15378.16704,
               30860.12808,2579.115607,6525.541272,229.6769525,2242.689259,27570.4852,
               23016.84778,1334.646773,402.6953275,6047.200797,394.1156638,385.5793827,
               1414.072488,5745.981529,837.7464011,1206.991065,27715.52837,18937.24998,
               39578.07441,478.2194906,16684.21278,279.2204061,5345.213415,6288.25324,
               1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,
               36152.66676,3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,
               39170.41371,2699.123242,21058.43643,28272.40661,37691.02733,9581.05659,
               5671.912202,757.4009286,347.7456605],index = ['Algeria','Angola','Argentina','Australia','Austria',
               'Bahamas','Bangladesh','Belarus','Belgium','Bhutan','Brazil',
               'Bulgaria','Cambodia','Cameroon','Chile','China','Colombia','Cyprus','Denmark',
               'El Salvador','Estonia','Ethiopia','Fiji','Finland','France','Georgia','Ghana',
               'Grenada','Guinea','Haiti','Honduras','Hungary','India','Indonesia','Ireland',
               'Italy','Japan','Kenya', 'South Korea','Liberia','Malaysia','Mexico', 'Morocco',
               'Nepal','New Zealand','Norway','Pakistan', 'Peru','Qatar','Russia','Singapore',
               'South Africa','Spain','Sweden','Switzerland','Thailand', 'United Arab Emirates',
               'United Kingdom','United States','Uruguay','Venezuela','Vietnam','Zimbabwe'])

In [13]:
print(a)

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

In [17]:
b = pd.Series(5.,index = ['a', 'b', 'c', 'd', 'e'])
b

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [18]:
a[0]

2255.225482

In [19]:
a[0:5]

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
dtype: float64

In [20]:
a.loc['United Kingdom']

28272.40661

In [21]:
a.iloc[1]

629.9553062

In [22]:
# Vector Series(vs)
vs1 = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'd'])
vs2 = pd.Series([10,20,30,40], index = ['a', 'b', 'c', 'd'])

In [23]:
vs1+vs2

a    11
b    22
c    33
d    44
dtype: int64

In [25]:
# After Shuffling the indexes of a series
vs2 = pd.Series([10,20,30,40], index = ['b', 'c', 'd', 'a'])

In [26]:
vs1+vs2

a    41
b    12
c    23
d    34
dtype: int64

In [27]:
# After changing some of the indexes
vs2 = pd.Series([10,20,30,40], index = ['b', 'c', 'e', 'f'])

In [28]:
vs1+vs2

a     NaN
b    12.0
c    23.0
d     NaN
e     NaN
f     NaN
dtype: float64

In [30]:
# Creating DataFrames
olympics = {'Hostcity':['London', 'Bejing', 'Athens', 'Sydney', 'Atlanta'],
                    'Year':[2012,2008,2004,2000,1996], 'No. of Participating Countries':
                    [205,204,201,200,197]}

In [31]:
df_olympics = pd.DataFrame(olympics)

In [33]:
df_olympics.style.set_table_styles([{'selector' : '',
                            'props' : [('border',
                                        '2px solid green')]}])

In [34]:
olymp_data = {'London':{2012:205}, 'Bejing':{2008:204}}

In [36]:
df_olymp_data = pd.DataFrame(olymp_data)
df_olymp_data

      London  Bejing
2012   205.0     NaN
2008     NaN   204.0

In [37]:
df_olympics.Hostcity

0     London
1     Bejing
2     Athens
3     Sydney
4    Atlanta
Name: Hostcity, dtype: object

In [38]:
df_olympics.describe

<bound method NDFrame.describe of   Hostcity  Year  No. of Participating Countries
0   London  2012                             205
1   Bejing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [ ]:
olympics = {'Hostcity':['London', 'Bejing', 'Athens', 'Sydney', 'Atlanta'],
                    'Year':[2012,2008,2004,2000,1996], 'No. of Participating Countries':
                    [205,204,201,200,197]}

In [39]:
olympics1 = pd.Series([205,204,201,200,197], index = [2012, 2008, 2004, 2000, 1996])
olympics2 = pd.Series(['London', 'Bejing', 'Athens', 'Sydney', 'Atlanta'],
                     index = [2012, 2008, 2004, 2000, 1996])

In [40]:
df_olympics1 = pd.DataFrame({'No. of Participating Countries': olympics1, 
                             'Host Cities': olympics2})

In [41]:
df_olympics1

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Bejing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [45]:
# Creating DataFrames with ndarrays
import numpy as np
np_array = np.array([2012,2008,2004,2006])
dict_ndarray = {'Year' : np_array}
print(dict_ndarray)

{'Year': array([2012, 2008, 2004, 2006])}

In [46]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [47]:
df_ndarray

   Year
0  2012
1  2008
2  2004
3  2006

In [53]:
df_from_df = pd.DataFrame(df_olympics)

In [54]:
df_from_df

  Hostcity  Year  No. of Participating Countries
0   London  2012                             205
1   Bejing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [56]:
olympics1 = pd.Series([205,204,201,200,197], index = [2012, 2008, 2004, 2000, 1996])
olympics2 = pd.Series(['London', 'Bejing', 'Athens', 'Sydney', 'Atlanta'],
                     index = [2012, 2008, 2004, 2000, 1996])
df_olympics1 = pd.DataFrame({'No. of Participating Countries': olympics1, 
                             'Host Cities': olympics2})

In [57]:
df_olympics1.describe

<bound method NDFrame.describe of       No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Bejing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta>

In [58]:
# Showing first two rows
df_olympics1.head(2)

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Bejing

In [60]:
# Showing last three rows
df_olympics1.tail(3)

      No. of Participating Countries Host Cities
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [61]:
# Showing indexes
df_olympics1.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [63]:
# Showing columns
df_olympics1.columns

Index(['No. of Participating Countries', 'Host Cities'], dtype='object')

In [67]:
# Showing Host Cities
df_olympics1['Host Cities']

2012     London
2008     Bejing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [69]:
# Showing another column
df_olympics1['No. of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating Countries, dtype: int64

In [71]:
# Finding the particular row with index no.
df_olympics1.loc[2004]

No. of Participating Countries       201
Host Cities                       Athens
Name: 2004, dtype: object

In [73]:
# Finding the particular rows with index nos. in range
df_olympics1.iloc[0:2]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Bejing

In [80]:
df_olympics.iat[3,1]

2000

In [81]:
df_olympics[df_olympics['No. of Participating Countries']>200]

  Hostcity  Year  No. of Participating Countries
0   London  2012                             205
1   Bejing  2008                             204
2   Athens  2004                             201

In [78]:
df_olympics

  Hostcity  Year  No. of Participating Countries
0   London  2012                             205
1   Bejing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [82]:
# Handling Missing Values
first_series = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])
second_series = pd.Series([10,20,30,40,50], index = ['c','e', 'f', 'g', 'h'])

In [83]:
sum_series = first_series+second_series
sum_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [87]:
# To remove the NaN values
dropna_s = sum_series.dropna()
dropna_s

c    13.0
e    25.0
dtype: float64

In [90]:
# To fill the NaN values with particular values
fillna_s = sum_series.fillna(0)
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [92]:
fill_na_with_zeros_before_sum = first_series.add(second_series, fill_value = 0)
fill_na_with_zeros_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [94]:
# Data Operation
df_movie_rating = pd.DataFrame({'movie 1': [5,4,3,3,2,1], 'movie 2': [4,5,2,3,4,2]}, 
                              index = ['Tom', 'Jeff', 'Peter', 'Rome', 'Ted', 'Paul'])
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Rome         3        3
Ted          2        4
Paul         1        2

In [98]:
# Creating a function 
def movie_grade(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    else:
        return 'F'

In [99]:
print(movie_grade(5))

A

In [102]:
# Applying a user-defined function on Pandas DataFrame
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Rome        C       C
Ted         F       B
Paul        F       F

In [103]:
# Data Operation with Statistical Functions
df_test_scores = pd.DataFrame({'Test 1': [95,84,73,88,82,61], 
                               'Test 2': [74,85,82,73,77,79]}, 
                             index = ['Jack', 'Levis', 'Patrick', 'Rich', 'Kelly', 'Paula'])

In [104]:
# Maximum Value
df_test_scores.max()

Test 1    95
Test 2    85
dtype: int64

In [105]:
# Mean Value
df_test_scores.mean()

Test 1    80.500000
Test 2    78.333333
dtype: float64

In [106]:
# Standard Deviation
df_test_scores.std()

Test 1    11.979149
Test 2     4.633213
dtype: float64

In [4]:
# Using GroupBy function
df_president_name = pd.DataFrame({'First':['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                 'Last': ['Bush', 'Clinton', 'Ragon', 'Carter', 'Washington']})

In [5]:
grouped = df_president_name.groupby('First')

In [113]:
grp_data = grouped.get_group('George')
grp_data

    First        Last
0  George        Bush
4  George  Washington

In [114]:
# Using Sort Function
df_president_name.sort_values('First')

    First        Last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Ragon

In [115]:
# Data Standardization
df_test_scores

         Test 1  Test 2
Jack         95      74
Levis        84      85
Patrick      73      82
Rich         88      73
Kelly        82      77
Paula        61      79

In [116]:
def standerdize_test(test):
    return (test-test.mean())/test.std()

In [118]:
standerdize_test(df_test_scores['Test 1'])

Jack       1.210437
Levis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test 1, dtype: float64

In [119]:
def standerdize_test_scores(datafrm):
    return datafrm.apply(standerdize_test)

In [120]:
standerdize_test_scores(df_test_scores)

           Test 1    Test 2
Jack     1.210437 -0.935276
Levis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

In [121]:
# Pandas Data Operation
df_student_math = pd.DataFrame({'student':['Tom', 'Jack', 'Dan', 'Ram', 'Jeff', 'David'],
                               'ID' : [10, 56, 31, 85, 9, 22]})

In [122]:
df_student_science = pd.DataFrame({'student':['Tom', 'Ram', 'David'],
                               'ID' : [10, 12, 22]})

In [123]:
# Merging two separate dataframes
pd.merge(df_student_math, df_student_science)

  student  ID
0     Tom  10
1   David  22

In [124]:
# Merging two separate dataframes with key
pd.merge(df_student_math, df_student_science, on = 'student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [125]:
# left join on key and also fill NaN with x
pd.merge(df_student_math, df_student_science, on = 'ID', how = 'left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [126]:
# Concatinating DataFrames
pd.concat([df_student_math, df_student_science], ignore_index = True )

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [130]:
# Creating New DataFrames
df_student_survey_data = pd.DataFrame({'student':['Tom', 'Jack', 'Tom', 'Ram', 'Jeff', 'Jack'],
                               'ID' : [10, 56, 10, 85, 9, 56]})

In [131]:
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [132]:
# Checking Duplicates
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [134]:
# Dropping the duplicates by name
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [135]:
# Dropping the duplicates by key
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [ ]:
# Pandas SQl Operation